fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_Отпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазностьДат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчестьБольшойОтпуск</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Данные = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	Год = Данные.Год;
	ТабОтпуска = Данные.Отпуска;
	ТабОтпуска.Сортировать("Сотрудник");
	Период.ДатаНачала = НачалоГода(Год) ;
	Период.ДатаОкончания = КонецГода(Год);
	
	ПостроитьДиаграммуГанта(ТабОтпуска, Год);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПостроитьДиаграммуГанта(ТабОтпуска, Год)
	
	ДиаграммаГанта.Обновление = Ложь;
    ДиаграммаГанта.Очистить();
		
	СерияОтпуск = ДиаграммаГанта.Серии.Добавить();
	СерияОтпуск.Текст = "Отпуска";	
	
    Для Каждого Стр Из ТабОтпуска Цикл    	
    	ТочкаСотрудник = ДиаграммаГанта.Точки.Добавить();	
    	ТочкаСотрудник.Текст = Стр.Сотрудник;
    	
    	ЗначениеСотрудник = ДиаграммаГанта.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
    	
		ИнтервалСотрудник = ЗначениеСотрудник.Добавить();
		ИнтервалСотрудник.Начало = Стр.ДатаНачала;
		ИнтервалСотрудник.Конец = Стр.ДатаОкончания;		
    КонецЦикла;
    
	ДиаграммаГанта.Обновление = Истина;

КонецПроцедуры

#КонецОбласти
